app/controllers/events_controller.rb

SELECT  "events".* FROM "events" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "events"
---
  def index
    @events = Event.page(params[:page]).per(5)

INSERT INTO "events" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "abc"], ["description", "abc"], ["created_at", "2015-07-20 06:04:08.798592"], ["updated_at", "2015-07-20 06:04:08.798592"]]
---
  def create
    @event = Event.new(event_params)
    if @event.save

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @page_title = @event.name
    @event = Event.find(params[:id])

UPDATE "events" SET "description" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["description", "abcd"], ["updated_at", "2015-07-20 06:34:43.602146"], ["id", 1]]
---
  def update
    if @event.update(event_params)